{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "[PAD]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "[BOS]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "[EOS]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": null,
    "pre_tokenizer": {
        "type": "Sequence",
        "pretokenizers": [
            {
                "type": "Split",
                "pattern": {
                    "String": "+"
                },
                "behavior": "Removed",
                "invert": false
            },
            {
                "type": "Split",
                "pattern": {
                    "String": "|"
                },
                "behavior": "Isolated",
                "invert": false
            },
            {
                "type": "Split",
                "pattern": {
                    "String": "\n"
                },
                "behavior": "Removed",
                "invert": false
            }
        ]
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "WordLevel",
        "vocab": {
            "[PAD]": 0,
            "[BOS]": 1,
            "[EOS]": 2,
            "+": 3,
            "|": 4,
            "barline": 5,
            "clef-C1": 6,
            "clef-C2": 7,
            "clef-C3": 8,
            "clef-C4": 9,
            "clef-C5": 10,
            "clef-F3": 11,
            "clef-F4": 12,
            "clef-F5": 13,
            "clef-G1": 14,
            "clef-G2": 15,
            "keySignature-AM": 16,
            "keySignature-AbM": 17,
            "keySignature-BM": 18,
            "keySignature-BbM": 19,
            "keySignature-C#M": 20,
            "keySignature-CM": 21,
            "keySignature-CbM": 22,
            "keySignature-DM": 23,
            "keySignature-DbM": 24,
            "keySignature-EM": 25,
            "keySignature-EbM": 26,
            "keySignature-F#M": 27,
            "keySignature-FM": 28,
            "keySignature-GM": 29,
            "keySignature-GbM": 30,
            "multirest-10": 31,
            "multirest-100": 32,
            "multirest-11": 33,
            "multirest-111": 34,
            "multirest-116": 35,
            "multirest-12": 36,
            "multirest-120": 37,
            "multirest-121": 38,
            "multirest-129": 39,
            "multirest-13": 40,
            "multirest-133": 41,
            "multirest-135": 42,
            "multirest-14": 43,
            "multirest-140": 44,
            "multirest-144": 45,
            "multirest-15": 46,
            "multirest-152": 47,
            "multirest-154": 48,
            "multirest-16": 49,
            "multirest-17": 50,
            "multirest-174": 51,
            "multirest-18": 52,
            "multirest-19": 53,
            "multirest-195": 54,
            "multirest-196": 55,
            "multirest-2": 56,
            "multirest-20": 57,
            "multirest-21": 58,
            "multirest-22": 59,
            "multirest-224": 60,
            "multirest-23": 61,
            "multirest-24": 62,
            "multirest-249": 63,
            "multirest-25": 64,
            "multirest-26": 65,
            "multirest-27": 66,
            "multirest-28": 67,
            "multirest-29": 68,
            "multirest-3": 69,
            "multirest-30": 70,
            "multirest-31": 71,
            "multirest-32": 72,
            "multirest-33": 73,
            "multirest-34": 74,
            "multirest-35": 75,
            "multirest-36": 76,
            "multirest-37": 77,
            "multirest-38": 78,
            "multirest-39": 79,
            "multirest-4": 80,
            "multirest-40": 81,
            "multirest-41": 82,
            "multirest-42": 83,
            "multirest-43": 84,
            "multirest-44": 85,
            "multirest-444": 86,
            "multirest-446": 87,
            "multirest-45": 88,
            "multirest-46": 89,
            "multirest-47": 90,
            "multirest-48": 91,
            "multirest-49": 92,
            "multirest-5": 93,
            "multirest-50": 94,
            "multirest-51": 95,
            "multirest-52": 96,
            "multirest-54": 97,
            "multirest-55": 98,
            "multirest-559": 99,
            "multirest-56": 100,
            "multirest-58": 101,
            "multirest-6": 102,
            "multirest-60": 103,
            "multirest-62": 104,
            "multirest-63": 105,
            "multirest-64": 106,
            "multirest-67": 107,
            "multirest-68": 108,
            "multirest-69": 109,
            "multirest-7": 110,
            "multirest-70": 111,
            "multirest-72": 112,
            "multirest-74": 113,
            "multirest-75": 114,
            "multirest-78": 115,
            "multirest-79": 116,
            "multirest-8": 117,
            "multirest-82": 118,
            "multirest-83": 119,
            "multirest-87": 120,
            "multirest-88": 121,
            "multirest-89": 122,
            "multirest-9": 123,
            "multirest-90": 124,
            "multirest-92": 125,
            "multirest-93": 126,
            "multirest-94": 127,
            "multirest-98": 128,
            "note-breve": 129,
            "note-breve.": 130,
            "note-eighth": 131,
            "note-eighth.": 132,
            "note-half": 133,
            "note-half.": 134,
            "note-hundred_twenty_eighth": 135,
            "note-long": 136,
            "note-quarter": 137,
            "note-quarter.": 138,
            "note-sixteenth": 139,
            "note-sixteenth.": 140,
            "note-sixty_fourth": 141,
            "note-sixty_fourth.": 142,
            "note-thirty_second": 143,
            "note-thirty_second.": 144,
            "note-whole": 145,
            "note-whole.": 146,
            "rest-256th": 147,
            "rest-512th": 148,
            "rest-breve": 149,
            "rest-eighth": 150,
            "rest-eighth.": 151,
            "rest-half": 152,
            "rest-half.": 153,
            "rest-hundred_twenty_eighth": 154,
            "rest-long": 155,
            "rest-quarter": 156,
            "rest-quarter.": 157,
            "rest-sixteenth": 158,
            "rest-sixteenth.": 159,
            "rest-sixty_fourth": 160,
            "rest-sixty_fourth.": 161,
            "rest-thirty_second": 162,
            "rest-thirty_second.": 163,
            "rest-whole": 164,
            "rest-whole.": 165,
            "timeSignature-1/16": 166,
            "timeSignature-1/2": 167,
            "timeSignature-1/4": 168,
            "timeSignature-1/8": 169,
            "timeSignature-10/1": 170,
            "timeSignature-10/16": 171,
            "timeSignature-10/4": 172,
            "timeSignature-10/8": 173,
            "timeSignature-100/2": 174,
            "timeSignature-11/16": 175,
            "timeSignature-11/4": 176,
            "timeSignature-11/8": 177,
            "timeSignature-12/16": 178,
            "timeSignature-12/32": 179,
            "timeSignature-12/4": 180,
            "timeSignature-12/8": 181,
            "timeSignature-13/16": 182,
            "timeSignature-13/4": 183,
            "timeSignature-13/8": 184,
            "timeSignature-14/4": 185,
            "timeSignature-14/8": 186,
            "timeSignature-15/16": 187,
            "timeSignature-15/4": 188,
            "timeSignature-15/8": 189,
            "timeSignature-16/16": 190,
            "timeSignature-16/4": 191,
            "timeSignature-16/8": 192,
            "timeSignature-17/16": 193,
            "timeSignature-17/4": 194,
            "timeSignature-17/8": 195,
            "timeSignature-18/16": 196,
            "timeSignature-18/4": 197,
            "timeSignature-18/8": 198,
            "timeSignature-19/16": 199,
            "timeSignature-19/32": 200,
            "timeSignature-19/4": 201,
            "timeSignature-2/1": 202,
            "timeSignature-2/16": 203,
            "timeSignature-2/2": 204,
            "timeSignature-2/32": 205,
            "timeSignature-2/4": 206,
            "timeSignature-2/8": 207,
            "timeSignature-20/4": 208,
            "timeSignature-20/8": 209,
            "timeSignature-21/16": 210,
            "timeSignature-22/16": 211,
            "timeSignature-23/16": 212,
            "timeSignature-23/4": 213,
            "timeSignature-23/8": 214,
            "timeSignature-24/16": 215,
            "timeSignature-24/4": 216,
            "timeSignature-27/16": 217,
            "timeSignature-29/4": 218,
            "timeSignature-3/1": 219,
            "timeSignature-3/16": 220,
            "timeSignature-3/2": 221,
            "timeSignature-3/4": 222,
            "timeSignature-3/8": 223,
            "timeSignature-32/8": 224,
            "timeSignature-33/32": 225,
            "timeSignature-35/16": 226,
            "timeSignature-35/32": 227,
            "timeSignature-37/16": 228,
            "timeSignature-4/1": 229,
            "timeSignature-4/16": 230,
            "timeSignature-4/2": 231,
            "timeSignature-4/4": 232,
            "timeSignature-4/8": 233,
            "timeSignature-5/16": 234,
            "timeSignature-5/2": 235,
            "timeSignature-5/4": 236,
            "timeSignature-5/8": 237,
            "timeSignature-52/4": 238,
            "timeSignature-6/16": 239,
            "timeSignature-6/2": 240,
            "timeSignature-6/4": 241,
            "timeSignature-6/8": 242,
            "timeSignature-63/4": 243,
            "timeSignature-7/1": 244,
            "timeSignature-7/16": 245,
            "timeSignature-7/2": 246,
            "timeSignature-7/4": 247,
            "timeSignature-7/8": 248,
            "timeSignature-8/16": 249,
            "timeSignature-8/2": 250,
            "timeSignature-8/4": 251,
            "timeSignature-8/8": 252,
            "timeSignature-80/4": 253,
            "timeSignature-9/16": 254,
            "timeSignature-9/32": 255,
            "timeSignature-9/4": 256,
            "timeSignature-9/8": 257,
            "timeSignature-C": 258,
            "timeSignature-C/": 259
        },
        "unk_token": "<unk>"
    }
}